supported = """
ሀ ሁ ሂ ሄ ህ ሆ
ለ ሉ ሊ ላ ሌ ል ሎ ሏ
ሐ ሑ ሒ ሓ ሔ ሕ ሖ ሗ
መ ሙ ሚ ማ ሜ ም ሞ ሟ
ሠ ሡ ሢ ሣ ሤ ሥ ሦ ሧ
ረ ሩ ሪ ራ ሬ ር ሮ ሯ
ሰ ሱ ሲ ሳ ሴ ስ ሶ ሷ
ሸ ሹ ሺ ሻ ሼ ሽ ሾ ሿ
ቀ ቁ ቂ ቃ ቄ ቅ ቆ ቋ
በ ቡ ቢ ባ ቤ ብ ቦ ቧ
ተ ቱ ቲ ታ ቴ ት ቶ ቷ
ቨ ቩ ቪ ቫ ቬ ቭ ቮ ቯ
ቸ ቹ ቺ ቻ ቼ ች ቾ ቿ
ኋ ኁ ኂ ኃ ኄ ኅ ኆ ኇ
ነ ኑ ኒ ና ኔ ን ኖ ኗ
ኘ ኙ ኚ ኛ ኜ ኝ ኞ ኟ
አ ኡ ኢ ኤ እ ኦ
ኧ
ከ ኩ ኪ ካ ኬ ክ ኮ
ኸ ኹ ኺ ኻ ኼ ኽ ኾ
ኳ
ወ ዉ ዊ ዋ ዌ ው ዎ
ዐ ዑ ዒ ዓ ዔ ዕ ዖ
ዘ ዙ ዚ ዛ ዜ ዝ ዞ ዟ
ዠ ዡ ዢ ዣ ዤ ዥ ዦ ዧ
የ ዩ ዪ ያ ዬ ይ ዮ
ደ ዱ ዲ ዳ ዴ ድ ዶ ዷ
ጀ ጁ ጂ ጃ ጄ ጅ ጆ ጇ
ገ ጉ ጊ ጋ ጌ ግ ጐ ጓ ጔ
ጘ ጙ ጚ ጛ ጜ ጝ ጞ ጟ
ጠ ጡ ጢ ጣ ጤ ጥ ጦ ጧ
ጨ ጩ ጪ ጫ ጬ ጭ ጮ ጯ
ጰ ጱ ጲ ጳ ጴ ጵ ጶ ጷ
ጸ ጹ ፂ ጻ ጼ ጽ ጾ ጿ
ፀ ፁ ፂ ፃ ፄ ፅ ፆ ፇ
ፈ ፉ ፊ ፋ ፌ ፍ ፎ ፏ
ፐ ፑ ፒ ፓ ፔ ፕ ፖ
""".split()

char_map = {}
char_map["'"] = 0
char_map["<SPACE>"] = 1
index = 2
for c in supported:
    char_map[c] = index
    index += 1
index_map = {v+1: k for k, v in char_map.items()}
